In [60]:
import pandas as pd
import numpy as np

In [61]:
#creating a series
series1 = pd.Series(np.random.randn(5),index=['one','two','three','four','five'])
series1
series1.to_frame()

              0
one   -0.489467
two   -0.324565
three  1.080456
four  -2.679623
five  -0.384474

In [62]:
series2 = pd.Series(np.random.randn(5),index=['one','two','three','four','five'])
series2.to_frame()

              0
one    2.737355
two   -0.030818
three -0.844363
four  -0.171557
five   0.656757

In [63]:
#join together two series as a single dataframe
dataframe1 = pd.concat([series1,series2],axis=1).reset_index()
dataframe1

   index         0         1
0    one -0.489467  2.737355
1    two -0.324565 -0.030818
2  three  1.080456 -0.844363
3   four -2.679623 -0.171557
4   five -0.384474  0.656757

In [64]:
dataframe1.iloc[3][1]

-0.17155745293818359

In [65]:
#drop rows and columns
dataframe3 = pd.DataFrame(np.random.randn(25).reshape(5,5),index=['one','two','three','four','five'],columns=['1st','2nd','3rd','4th','5th'])
dataframe3

            1st       2nd       3rd       4th       5th
one   -0.682033  0.431978  1.105065 -1.194521  0.692850
two    0.250833  0.365109  0.288246  0.165251 -1.385084
three  2.049166  0.897395  1.106270 -0.571274 -1.735933
four  -0.129262  0.403647 -0.501647 -1.425969  0.605066
five   0.943394 -1.346106 -1.488323  0.504189 -1.136862

In [66]:
dataframe3 = dataframe3.drop('two')
dataframe3

            1st       2nd       3rd       4th       5th
one   -0.682033  0.431978  1.105065 -1.194521  0.692850
three  2.049166  0.897395  1.106270 -0.571274 -1.735933
four  -0.129262  0.403647 -0.501647 -1.425969  0.605066
five   0.943394 -1.346106 -1.488323  0.504189 -1.136862

In [67]:
dataframe3 = dataframe3.drop('2nd',axis=1)
dataframe3

            1st       3rd       4th       5th
one   -0.682033  1.105065 -1.194521  0.692850
three  2.049166  1.106270 -0.571274 -1.735933
four  -0.129262 -0.501647 -1.425969  0.605066
five   0.943394 -1.488323  0.504189 -1.136862

In [68]:
dataframe3.drop('3rd',axis=1, inplace=True)
dataframe3

            1st       4th       5th
one   -0.682033 -1.194521  0.692850
three  2.049166 -0.571274 -1.735933
four  -0.129262 -1.425969  0.605066
five   0.943394  0.504189 -1.136862